app/controllers/purchases_controller.rb

  def create
    @purchase = Purchase.create(purchase_params)
    @purchase.update(idempotency_token: Base64.encode64((@purchase.id*100).to_s), description: 'Purchase in poker academy', product: 'Best poker course', ip_address: request.remote_ip)
---
INSERT INTO "purchases" ("name", "email", "cost", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "PruebaPost1"], ["email", "greatfaiber@gmail.com"], ["cost", 200000.0], ["quantity", 2], ["created_at", "2019-04-06 20:11:15.518319"], ["updated_at", "2019-04-06 20:11:15.518319"]]
UPDATE "purchases" SET "description" = ?, "idempotency_token" = ?, "ip_address" = ?, "updated_at" = ?, "product" = ? WHERE "purchases"."id" = ?  [["description", "Purchase in poker academy"], ["idempotency_token", "NzAw\n"], ["ip_address", "::1"], ["updated_at", "2019-04-06 20:11:15.531817"], ["product", 0], ["id", 7]]

  def show
    @purchase = Purchase.find(params[:id])
    response = GetRequest.new(@purchase).get
    @purchase.update(status: response['status'])
---
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = ? LIMIT ?  [["id", 90], ["LIMIT", 1]]
UPDATE "purchases" SET "payment_url" = ?, "updated_at" = ? WHERE "purchases"."id" = ?

  def index
    @purchases = Purchase.all
---
SELECT "purchases".* FROM "purchases"